IDENTIFICATION DIVISION.
PROGRAM-ID. PROG1.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 SNAME PIC A(30).
01 MARKS PIC 9(3) VALUE 0.
01 REG-NO PIC X(10).
PROCEDURE DIVISION.
DISPLAY 'HELLO FROM COBOL'.
MOVE 'RAJESH KUMAR' TO SNAME.
MOVE 78 TO MARKS.
MOVE 'JH-BK1234' TO REG-NO.
DISPLAY 'HELLO MR.' SNAME.
DISPLAY 'YOUR REGISTRATION NUMBER IS ' REG-NO.
DISPLAY 'YOUR OBTAINED MARKS IS ' MARKS.
DISPLAY
